#!/usr/bin/python
# -*- coding: utf-8 -*-  
import MongoController
from selenium import webdriver
from bs4 import BeautifulSoup
import time
import re

'''
	always use one time when in new mongodb environment 
'''
if __name__ == '__main__':

	options={
		'url':'mongodb://localhost:27017/',
		'db':'industry',
		'collection':'cement'
	}
	mongo = MongoController.MongoController(options);
	webpage = webdriver.PhantomJS(executable_path='./bin/phantomjs')
	webpage.get("http://jdata.yuanta.com.tw/z/zh/zhc/zhc.djhtm?a=C012033")
	soup = BeautifulSoup(webpage.page_source, 'html.parser')
	test = soup.find('td','t3t1')
	test_a = (test.find('a')).text
	print test_a
	industryStr = "EB011000 水泥類~C011010 水泥,C011011 水泥製品,C099192 高爐水泥,C025012 預拌混凝土;EB012000 食品類~C012010 ,C012037 ,C012020 大宗物資,C012011 方便麵,C012031 水產品加工,C012034 可可製品,C012028 白酒,C012024 肉品加工,C012014 乳製品,C012022 油脂,C012013 非酒精飲料,C012033 保健食品,C012027 紅酒,C012016 食品加工,C012018 家畜，家禽,C012026 啤酒,C012029 農產品加工,C012023 飼料,C012012 製糖,C017240 製鹽,C012035 穀類烘焙製品,C012015 調味品,C012036 磨粉製品,C012032 糖果製品,C012021 麵粉,C012030 麵製品相關,C012017 罐頭,C012019 釀酒;EB013000 塑膠類~C013070 ABS,C013040 DOP,C017083 EVA,C013190 PA,C013030 PE,C013110 PP,C013080 PS,C013010 PVC,C013060 SM,C099100 加油站,C013990 石化業,C013001 石油開採,C099110 油品儲運／分銷,C013050 芳香烴,C013130 烯烴,C013180 塑膠加工,C013090 塑膠皮布,C013002 煉油,C013191 燃氣儲運／分銷,C013192 瀝青;EB014000 紡織纖維類~C013120 AN,C014063 CPL,C014061 EG,C014062 PTA,C014210 工業用布,C014201 不織布,C014183 內衣褲、襪,C014060 化纖原料,C014170 毛紡,C014150 加工絲,C014069 半合成纖維,C014032 尼龍加工絲,C014031 尼龍粒,C014033 尼龍絲,C014206 尼龍塔夫塔,C014030 尼龍製品,C014068 再生纖維,C014180 成衣,C014181 成衣製造,C014182 成衣銷售／零售,C014140 羊毛,C014208 羽絨加工,C014051 亞克力紗,C014050 亞克力棉,C014066 芳綸,C014190 染整,C014065 氨綸,C014990 紡織中游,C014014 紡織用聚酯粒,C014205 純棉紗,C014173 混紡紗,C014015 瓶用聚酯粒,C014203 魚網,C014171 麻紡,C014064 粘膠,C014202 棉紡,C014172 絲織品,C014067 聚丙烯纖維,C014012 聚酯加工絲,C014204 聚酯紗,C014013 聚酯棉,C014011 聚酯絲,C014010 聚酯纖維,C014207 黏扣帶,C014200 織布,C014016 寶特瓶;EB015000 電機機械類~C015080 工具機,C015120 工程機械,C015156 工業用縫紉機,C015152 工業馬達,C015104 手工具機,C015100 木工機械,C015113 包裝機械,C015204 污染控制設備,C015201 自行車零件,C015160 自動化儀器,C015028 車用充電相關,C015108 空調冷氣設備,C015155 軌道運輸設備,C015021 重型電氣設備,C015151 飛機零件／製造,C015153 家用縫紉機,C015170 柴油機,C015207 海洋工程設備,C015101 紡織機械,C015102 配電工程,C015106 配電盤,C015116 動力機械,C015110 產業機械,C015115 通用機械,C015150 造船,C015111 塑膠機械,C015205 裝載機,C015130 農用機械,C015203 電力配送服務,C015990 電力設備,C015027 電氣自控設備,C015026 電氣開關設備,C015022 電氣零件與設備,C015020 電機,C015103 蓄電池相關,C015202 儀器、儀表,C015154 模具,C015112 橡膠機械,C015770 機械,C015140 機械零組件,C015180 機器人,C015025 輸配電設備,C015081 龍門機,C015090 壓縮機,C015107 幫浦,C015023 鍋爐,C015206 醫療保健設備／裝置,C015024 變電設備,C015109 變頻器;EB016000 電器電纜類~C015010 小家電,C015014 冷氣機,C015013 洗衣機,C015015 音響／視聽組合,C015880 家電,C016011 通訊電纜,C015060 照明,C016012 電子線,C015012 電冰箱,C015011 電視機,C016010 電線電纜,C015016 電器銷售,C016013 漆包線,C016014 裸銅線;EB018000 玻璃陶瓷類~C099133 水龍頭,C014209 地毯,C018070 岩棉,C018014 金屬建材,C099131 門用金屬,C018010 建材,C018020 玻璃,C018030 家居用品,C018990 陶瓷,C099130 傢俱,C099132 窗簾,C018040 釉料,C015030 電梯,C099193 寢具,C018012 輕鋼架,C018060 廚具,C018050 衛浴設備,C018013 複合板,C018031 辦公室傢俱,C099180 鎖;EB019000 造紙類~C019020 工業用紙,C019030 文化用紙,C019050 包裝用紙,C019040 家庭用紙,C019010 紙漿,C019990 造紙業;EB020000 鋼鐵類~C020113 工具鋼,C020110 不鏽鋼,C020116 不鏽鋼品,C020117 不鏽鋼剪裁加工,C020118 不鏽鋼管,C020119 不鏽鋼緊固件,C020121 不鏽鋼線材,C020111 合金鋼,C020114 冷軋不鏽鋼,C020090 冷軋鋼捲,C020990 板鋼,C020130 非鐵金屬,C020060 型鋼,C020120 烤漆鋼捲,C020112 特殊鋼,C020050 條鋼,C020191 釩,C020150 棒鋼,C020149 稀土,C020170 貴金屬,C020134 黃金,C020139 鈦,C020146 鈀,C020190 塗鍍鋼捲,C020145 鈾,C099080 鉛,C020136 鉑,C020135 鉭,C020147 鉬,C020144 銀,C020131 銅,C020115 熱軋不鏽鋼,C020020 熱軋鋼捲,C020030 線材、盤元,C020138 鋅,C020132 鋁,C020143 鋁擠型,C020140 鋯,C020180 鋼板,C020011 鋼胚,C020160 鋼剪裁加工,C020040 鋼筋,C020070 鋼結構,C020080 鋼管,C020141 錫,C020021 螺絲、螺帽,C020100 鍍鋅鋼捲,C020148 鎂合金,C020142 鍶,C020137 鎢,C020133 鎳,C020012 鐵礦砂;EB021000 橡膠類~C021090 天然橡膠,C021070 合成橡膠,C021110 乳膠相關,C021080 油封,C021060 碳煙,C021100 熱可塑橡膠,C021010 輪胎,C021990 橡膠工業,C021050 橡膠製品;EB022000 汽車類~C022060 ,C022066 ,C022048 引擎相關,C022045 木床／車架,C022056 安全氣囊,C099050 自行車,C022032 自動駕駛車,C022067 行車紀錄器,C022030 沙灘車,C022055 汽車內裝,C022031 汽車服務相關,C022043 汽車空調,C022011 汽車保險桿,C022050 汽車音響,C022061 汽車座椅,C022046 汽車鈑金,C022005 汽車製造,C022010 汽車銷售,C022012 汽車融資,C022040 汽機車零組件,C022065 車用冷卻系統,C022070 車用金屬成型,C022049 車用玻璃,C022052 車用電子,C022080 車用電池,C022042 車用鍛件,C022041 車用鑄件,C022059 車載影音系統,C022910 車輛整車,C015105 車燈,C022069 抬頭顯示器(HUD),C022063 剎車系統,C022912 客貨車輛相關,C022054 活塞,C022057 胎壓監測系統,C022058 倒車雷達,C022068 倒車影像系統,C022911 特種車輛相關,C022051 傳動系統,C022047 儀表板,C022053 輪圈,C022020 機車,C022062 轉向系統,C022064 懸吊系統;EB025000 建材營造類~C025910 公路,C025920 水利,C025032 水電消防工程,C099372 交通號誌,C025020 住宅建設,C025011 房屋仲介,C025092 物業投資發展,C025030 建築設計、營繕裝璜,C099371 停車場,C025900 基礎建設營運,C025940 港口,C025031 園林造景,C025093 園區開發,C025970 路橋,C025012 預拌混凝土,C025094 墓園經營,C025960 駕訓班,C025930 機場,C025010 營建,C025090 營造工程,C025950 鐵路;EB026000 航運業類~C026061 水上運輸,C026062 油輪,C029030 物流業,C026050 空運,C026060 客運,C026010 倉儲／貨櫃場,C026020 貨櫃航運,C026070 貨櫃製造,C026040 陸運,C026030 散裝航運,C026990 運輸事業,C026063 鐵路運輸服務;EB027000 觀光類~C027029 化妝品,C027021 主題樂園,C027015 休閒食品零售,C027012 休閒娛樂,C027050 便利商店,C027040 美容,C027025 俱樂部,C027020 旅遊,C027010 旅館、餐飲,C027027 時尚產業,C027030 珠寶,C027026 陳列展覽相關,C027022 博奕相關,C027014 渡假山莊,C027011 飯店,C027023 運動競賽,C027024 電影院／劇院,C027028 精品,C027013 餐飲;EB028000 金融保險類~C028122 再保險,C028070 投信,C028090 投資信託,C028100 金控,C028120 金融其他,C028990 金融業,C028110 租賃,C028030 產險,C028040 票券,C028121 資產管理,C028020 壽險,C028010 銀行,C028060 證券,C028050 證金公司;EB029000 貿易百貨類~C029010 百貨公司,C029092 直銷,C027050 便利商店,C029001 流通業,C029040 相片沖印,C029080 食品飲料相關通路,C029094 家居相關用品通路,C029021 書店,C029070 連鎖超市,C029090 無店舖販售,C029020 貿易,C029091 郵購,C029050 量販店、大賣場,C029093 電視購物,C029060 藥粧零售相關;EB030000 化工類~C017320 MDI,C017081 PU樹脂,C013172 PVC布,C017330 TDI,C017280 丁二醇,C017290 二甲基甲醯胺(DMF),C013173 工業氣體,C017880 化學工業,C017493 化學產品通路,C013170 正烷屬烴,C017492 石油支撐劑,C017180 石墨,C013171 石蠟,C017080 合成樹脂,C017340 有機矽,C017210 尿素,C017990 其他化工產品,C017230 拋光蠟,C017055 肥料,C017130 保險粉,C017040 染料，顏料,C017260 氟化物,C017200 炸藥,C017491 氣凝膠,C017051 草甘膦,C017494 強酸產品,C017360 硫磺,C013160 烷基苯,C017391 酚,C017140 硝化棉,C017220 硝酸銀,C017370 黃磷,C017250 鈦白粉,C018011 塗料,C013150 溶劑,C017270 煤化工,C017050 農藥,C017490 電池材料相關,C017170 碳酸鋇,C017160 熱溶膠,C017060 膠帶,C017030 衛生清潔用品,C017390 醋酸,C017380 環氧丙烷,C017190 磷化工,C017310 磷酸一銨(MAP),C017300 磷酸二銨(DAP),C017350 雙酚A,C017120 鹼業;EB031000 生技醫療類~C017117 ,C017134 人造關節,C017012 中藥製劑,C017126 手術與治療用醫材,C017135 牙科植入器材,C017021 生技服務,C017018 生技特用化學品,C017106 生命科學工具,C017010 生物科技,C017016 生物製劑,C017123 生理監測裝置,C017124 生理檢測器材,C017111 血糖儀,C017110 血壓計,C017011 西藥製劑,C017132 其他手術器械,C017137 其他醫療器材,C017128 呼吸與麻醉用器具,C017129 放射治療設備,C017127 物理治療器具,C017114 洗腎器具,C017108 食品生技,C017138 個人保護用器材,C017013 原料藥,C017136 骨科類器材,C017102 健身器材,C017131 動力手術器具,C017105 動物用藥,C017022 植物工廠,C017015 植物新藥,C017122 診斷與監測用醫材,C017014 新藥研發,C017019 農業生技,C017101 電動代步車,C017104 福祉輔助設備,C017017 維生素,C017133 輔助與彌補用醫材,C017119 檢驗試劑／紙,C017121 檢驗儀器設備,C017020 環保生技,C017113 隱形眼鏡,C017139 醫用家具,C017115 醫用植入材料,C017125 醫學影像裝置,C017103 醫療服務,C017109 醫療耗材,C017141 醫療管理服務,C017100 醫療器材通路,C017116 醫藥流通,C017000 醫藥產業,C017118 體外診斷用醫材,C017112 體溫計;EB032000 半導體類~C023397 ,C023209 ASIC,C023222 CMOS晶片,C023176 CPU,C023170 DRAM,C023156 DRAM記憶體IC,C023162 DSL晶片組,C023177 DSP,C023159 FLASH記憶體IC,C023180 IC生產,C023200 IC封裝,C023203 IC封裝測試,C023331 IC基板,C023190 IC設計,C023189 IC設計軟體,C023201 IC測試,C023328 IC量測設備,C023390 IC製造,C023184 IO控制IC,C023197 LCD控制IC,C023193 LCD驅動IC,C023204 LCD驅動IC封裝,C023332 LED驅動IC,C023199 MCU,C023336 MEMS,C023198 PC週邊IC,C023157 SRAM記憶體IC,C023172 STB IC,C023205 USB,C023167 VOIP IC,C023395 二極體,C023323 化合物晶圓,C023292 手機面板驅動IC,C023295 功率放大器,C023326 半導體設備,C023225 生物辨識IC,C023327 光阻劑,C023319 光通訊元件磊晶,C023320 光罩,C023196 光碟機驅動IC,C023921 低雜訊放大器,C023169 來電顯示IC,C023185 其他IC,C023322 矽晶圓,C023202 金、錫凸塊,C023160 非揮發性記憶體,C023850 封測服務與材料,C023325 研磨液,C023920 射頻前端晶片,C023923 射頻前端模組,C023922 射頻開關,C023324 氧化物晶圓,C023195 消費性IC,C023187 砷化鎵相關,C023221 記憶卡IC,C023178 馬達IC,C023181 專業晶圓代工,C023208 探針、探針卡,C023206 設計IP,C023223 嵌入式晶片,C023191 晶片組,C023171 智慧卡IC,C023851 測試用板卡,C023166 無線網路IC,C023165 集線器IC,C023224 感測元件,C023179 電池保護IC,C023396 電晶體,C023164 網路卡IC,C023192 網路通訊IC,C023207 影音IC,C023333 數位電視IC,C023174 數據機晶片組,C023321 磊晶,C023168 衛星導航晶片組,C023330 導線架,C023329 藍寶石晶棒,C023173 繪圖IC,C023183 類比IC,C023334 觸控面板IC;EB033000 電腦及週邊設備類~C023991 ,C023496 3D印表機,C023994 Displayport,C023995 HDMI,C023328 IC量測設備,C023580 IC讀卡機,C023372 LED設備,C023104 PCB其他設備,C023410 PDA,C023993 Thunderbolt,C015040 UPS,C023510 工業電腦,C023376 太陽能設備,C023660 手寫板,C023300 主機板,C023326 半導體設備,C023457 平板電腦,C023270 光碟片,C023260 光碟機,C023492 印表機,C023497 印表機耗材,C023145 伺服器,C023231 投影機,C023377 事務機器,C023690 矽碟機,C023852 封測用設備,C023373 面板設備,C023701 音效卡,C023590 音響設備及零件,C023140 桌上型電腦,C023493 記憶卡,C023760 專業代工,C023220 掃瞄器,C023560 條碼掃描器,C023370 設備儀器廠商,C023153 散熱模組,C023725 智慧卡相關,C023375 無塵室工程,C023680 硬碟相關,C023150 筆記型電腦,C023151 筆記型電腦製造,C023490 週邊產品,C023378 量測儀器,C023992 傳輸介面,C023240 滑鼠,C023702 準系統,C023103 雷射鑽孔機、鑽頭,C023990 電腦系統業,C023630 磁碟陣列控制器,C023271 碟片預錄,C023471 播放機,C023724 數位相框,C023155 熱導管,C023472 燒錄機,C023495 儲存設備,C023154 鎂鋁合金外殼,C023250 鍵盤,C023700 繪圖卡,C023374 觸控面板設備,C023230 顯示器;EB034000 光電類~C023236 3D顯示相關,C023237 LCD顯示器,C023031 LCM,C023040 LED,C023042 LED封裝,C023047 LED基板,C023041 LED晶粒,C023046 LED應用,C023037 OLED,C023735 PV Inverter,C023025 TFT-LCD,C023026 TN／STN LCD,C023020 中小尺吋面板,C023730 太陽能,C023734 太陽能系統運用,C023731 太陽能矽晶圓,C023737 太陽能玻璃,C023732 太陽能電池,C023733 太陽能電池模組,C023736 太陽能導電漿,C023500 光通訊,C023270 光碟片,C023035 光學膜,C023422 光學鏡片／頭,C023996 光纖主動元件,C016015 光纖光纜,C023997 光纖被動元件,C023998 光纖設備,C023999 光纖零組件,C023028 冷陰極燈管,C023231 投影機,C023232 投影機零件,C023034 玻璃基板,C023038 玻璃基板加工,C023045 紅外線傳輸模組,C023027 背光模組,C023015 面板業,C023016 面板零組件,C023029 偏光板,C023380 彩色濾光片,C023032 液晶,C023234 液晶電視,C023036 電子紙,C023233 電漿電視,C023271 碟片預錄,C023030 影像感測元件,C023420 數位相機,C023421 數位相機組裝,C023238 數位看板,C023033 導電玻璃,C023048 藍寶石基板,C023158 觸控面板,C023230 顯示器,C023235 顯示器零件;EB035000 通信網路類~C023407 4G通訊設備,C023312 5G通訊設備,C023400 Internet相關,C023408 RFID相關,C023412 入口網站,C023403 小型衛星地面站,C023298 天線,C023288 手機,C023294 手機外殼,C023296 手機按鍵,C023423 手機相機模組,C023292 手機面板驅動IC,C023335 手機晶片相關,C023293 手機製造,C023136 手機震動馬達,C023295 功率放大器,C023297 收送話器,C023502 行動通訊,C023406 低雜訊降頻器,C023314 物聯網裝置,C023416 社群網站,C023101 乾膜光阻,C023315 區域網路,C023404 基地台,C023310 接取設備,C023280 通訊網路,C023399 智慧型手機,C023401 無線網路,C023274 無線網路設備系統(WLAN),C023415 雲端科技,C023411 搜尋引擎,C023313 資訊安全,C023413 電子商務,C023285 電信／數據服務,C023283 電信設備,C023090 電話／傳真機,C023405 網路交換器,C023273 網路電話(VOIP),C023414 數位內容,C023311 數據機,C023503 衛星電話,C023402 衛星導航,C023102 鐵氟龍基板;EB036000 電子零組件類~C023397 ,C023209 ASIC,C023994 Displayport,C023391 DRAM模組,C023393 Flash模組,C023995 HDMI,C023061 MLCC,C023105 PCB材料,C023104 PCB其他設備,C023993 Thunderbolt,C023395 二極體,C023394 分離式元件,C023136 手機震動馬達,C023300 主機板,C023067 石英元件,C023327 光阻劑,C023210 印刷電路板,C023219 印刷電路板相關,C023232 投影機零件,C023130 其他零件,C023100 玻纖布,C023325 研磨液,C023075 振盪器,C023187 砷化鎵相關,C023101 乾膜光阻,C023380 彩色濾光片,C023208 探針、探針卡,C023060 被動元件,C023069 被動元件上游,C023152 軟板,C023161 軟板基板,C023120 連接器,C023135 散熱風扇馬達,C023153 散熱模組,C023062 晶片電阻,C023055 無線充電,C023610 程式開關,C023992 傳輸介面,C023072 塑膠膜電容器,C023103 雷射鑽孔機、鑽頭,C023480 電子化工材料,C023139 電子零件元件,C023132 電池相關,C023064 電阻,C023063 電容,C023396 電晶體,C023066 電感,C023050 電源供應器,C023052 馳返變壓器,C023071 鉭質電解電容,C023630 磁碟陣列控制器,C023272 網路卡,C023212 銅箔,C023211 銅箔基板,C023137 樞紐,C023134 模具沖壓,C023073 熱敏電阻,C023068 鋁質電解電容,C023070 機殼,C023076 壓敏電阻,C023154 鎂鋁合金外殼,C023074 濾波器,C023158 觸控面板,C023102 鐵氟龍基板,C023051 變壓器,C023235 顯示器零件;EB037000 電子通路類~C023357 3C通路商,C023352 IC零組件通路商,C023358 半導體材料通路商,C023353 其他電子通路商,C023356 消費性電子通路商,C023367 軟體通路／代理,C023351 通訊通路商,C023359 電子通路,C023350 電腦通路商,C023355 影音通路商;EB038000 資訊服務類~C023189 IC設計軟體,C023454 MP3,C023362 PC遊戲,C023721 POS機系統,C023369 人工智慧,C023365 大數據,C023803 手機遊戲,C023364 企業資源規劃,C023550 安全監控系統,C023341 作業系統,C023340 系統整合,C023456 股票金融機,C023366 客戶關係管理,C023361 套裝軟體,C023801 商用遊戲機,C023760 專業代工,C023206 設計IP,C023360 軟體業,C023371 虛擬實境,C023722 視訊會議產品,C023451 視訊轉換相關,C023363 資料庫,C023800 遊戲產業,C023455 遊戲機,C023342 電子支付,C023990 電腦系統業,C023452 數位電視,C023368 應用軟體;EB039000 其他電子類~C023580 IC讀卡機,C023721 POS機系統,C023902 人臉辨識,C023900 生物辨識相關,C023726 多媒體產品,C023550 安全監控系統,C023297 收送話器,C023881 耳機,C023883 免持聽筒,C023377 事務機器,C023901 指紋辨識,C023727 穿戴式裝置,C023903 虹膜辨識,C023460 消費性電子產品,C023560 條碼掃描器,C023904 掌紋辨識,C023728 智慧手錶,C023738 智慧手環,C023725 智慧卡相關,C023729 智慧眼鏡,C023375 無塵室工程,C023722 視訊會議產品,C023882 微型揚聲器,C023884 微型電聲元件,C023080 電子其他,C023710 電子計算機,C023723 電子書閱讀器,C023720 電子錶,C023090 電話／傳真機,C023880 電聲產品,C023905 語音辨識,C023379 辦公用品設備,C023081 檢測驗證服務;EB040000 油電燃氣類~C023730 太陽能,C099368 太陽能發電,C099364 水力發電,C099361 火力發電,C099100 加油站,C099363 地熱發電,C099362 汽電共生,C099367 供熱,C099110 油品儲運／分銷,C099365 風力發電,C099366 核能發電,C099360 電力,C013191 燃氣儲運／分銷;EB098000 綜合類~C098020 控股公司,C098010 綜合;EB099000 其他類~C011025 ,C099170 ,C099350 ,C099353 ,C099394 人力資源,C099338 工安產品,C099160 工程顧問,C099310 工藝品,C099070 天然氣,C099368 太陽能發電,C099194 手提箱,C099300 文具,C099336 木(竹)加工／製品,C099364 水力發電,C025920 水利,C025980 水資源,C025983 水資源設備／耗材,C099133 水龍頭,C099361 火力發電,C099092 出版業,C099240 打火機,C099230 皮革製品,C099290 光學,C099093 印刷業,C099334 回收、焚化相關,C099363 地熱發電,C099097 有線電視,C025982 污水處理廠,C099050 自行車,C099330 自動販賣機,C099362 汽電共生,C099367 供熱,C099210 底片,C099190 拉鍊,C099390 服務業,C011022 林業,C099354 油氣採掘服務,C099351 油氣採掘設備與工程,C099200 玩具,C099320 金融機具,C099337 金屬加工／製品,C099352 金屬礦採選,C099131 門用金屬,C099040 保全,C099345 軍火工業,C099365 風力發電,C011024 食用菌種植,C099366 核能發電,C099391 消費者服務,C025981 海水淡化,C099140 烤肉架,C099340 航天軍工,C099344 航天通訊零組件,C099343 航天機械零組件,C099342 航空器、飛機,C099150 高爾夫球桿頭,C099192 高爐水泥,C099392 商業服務／顧問,C099397 婚宴顧問,C099393 教育事業,C099398 清潔服務,C099384 球具,C099385 球場,C099031 瓶蓋,C099260 眼鏡,C099270 眼鏡架,C099094 報紙業,C099132 窗簾,C099010 傳產其他,C099090 傳播事業,C099335 煙草,C099060 資產股,C011020 農林漁牧,C011021 農產品種植,C099383 運動用品,C099381 運動服,C099380 運動產業,C099382 運動鞋,C099360 電力,C099091 電視台,C099193 寢具,C011023 漁業,C099395 碳權相關,C011026 種子生產,C099280 製帽,C099030 製罐,C099095 廣告,C099096 影視,C099332 樂器,C099341 衛星相關,C099333 複合材料,C099021 鞋材,C099020 鞋業,C099250 嬰童用品,C099191 環保工程,C099396 殯葬服務,C099180 鎖,C099331 寵物用品,C011027 礦石開採,C099355 礦產採掘服務,C099220 鐘錶;EB170000 文化創意類~C023362 PC遊戲,C099310 工藝品,C099400 文化創意產業,C099092 出版業,C099097 有線電視,C029021 書店,C023801 商用遊戲機,C099094 報紙業,C099090 傳播事業,C023800 遊戲產業,C099091 電視台,C099095 廣告,C099096 影視,C023414 數位內容"
	industryArr = industryStr.split(';')
	print len(industryArr)

	categoryIdArr = []
	categoryNameArr = []
	mongo.createCollection("all")
	for index in range(0,len(industryArr)):
		print "===="
		category = (industryArr[index].split('~'))[0]
		category_id = (category.split(' '))[0]
		category_name = (category.split(' '))[1]
		print "=============="
		print "category_name : " + category_name
		print "category_id : " + category_id
		categoryIdArr.append(category_id)
		categoryNameArr.append(category_name)
		mongo.createCollection(category_id)
		
		item = (industryArr[index].split('~'))[1]
		item_each = item.split(',')
		for item_index in range(0,len(item_each)):
			item_id = (item_each[item_index].split(' '))[0]
			item_name = (item_each[item_index].split(' '))[1]
			print item_name
			print item_id
			mongo.changeCollection(category_id)
			mongo.insertData({
								"itemId"   : item_id,
								"itemName" : item_name
 							});
			webpage.get("http://jdata.yuanta.com.tw/z/zh/zhc/zhc.djhtm?a=" + item_id )
			soup = BeautifulSoup(webpage.page_source, 'html.parser')
			stock_td_tag = soup.find_all('td','t3t1')
			stock_td_tag_rev = soup.find_all('td','t3t1_rev')
			exist_bool = mongo.createCollection(item_id)
			if(exist_bool is True):
				
				mongo.changeCollection(item_id)

				for td in stock_td_tag:
					a_str = (td.find('a')).text
					stock_id = re.match('\d+\w?',a_str).group(0)
					stock_name = re.sub(stock_id+"\s*", "", a_str)
					mongo.insertData({
										"stockId"   : stock_id,
										"stockName" : stock_name
									});
					print stock_id
					print stock_name

				for td in stock_td_tag_rev:
					a_str = (td.find('a')).text
					stock_id = re.match('\d+\w?',a_str).group(0)
					stock_name = re.sub(stock_id+"\s*", "", a_str)
					mongo.insertData({
										"stockId"   : stock_id,
										"stockName" : stock_name
									});
					print stock_id
					print stock_name
				
			
		time.sleep(1)

	mongo.changeCollection("all")
	for index in range(0,len(categoryIdArr)):
		mongo.insertData({
			"categoryId"   : categoryIdArr[index],
			"categoryName" : categoryNameArr[index]
		});
	

	print categoryIdArr
	print categoryNameArr